[
  {
    "url": "https://jamesclear.com/3-2-1/december-25-2025",
    "title": "3-2-1: On regret, how to have your best ideas, and the key to respect",
    "ideas": [
      "“To learn, wander. To achieve, focus.”",
      "​II. “The amateur does not know what to do. The master knows what not to do.”",
      "“It is nearly impossible to have your best idea the first time you think about something. The most likely way to uncover important insights is to frequently revisit a problem. The longer you're in the game, the more ideas bubble up to the surface. Time unlocks insights.”"
    ],
    "scraped_at": "2025-12-30T11:47:32.167466"
  },
  {
    "url": "https://jamesclear.com/3-2-1/december-18-2025",
    "title": "3-2-1: On finding your desired lifestyle, a simple rule for life, and working with what you have",
    "ideas": [
      "“Optimize for your desired lifestyle, not your desired title.”",
      "​II. “Reflection requires stillness. One cost of rushing from thing to thing is that you lose the space to think. Hard work matters, but nonstop motion often hides a quiet truth: you could have used your time better. If you never pause, you confuse activity with effectiveness. Make time to think. Walk outside. Sit quietly. Create space. Then move again, but this time on purpose.”",
      "“Here's a rule I find useful: You should attempt things that are difficult enough to guarantee some early embarrassment, but important enough that long-term regret is unlikely. Trying something difficult will usually make you look foolish or inexperienced. That’s fine. That's the cost of learning. But if it's important to you, then you'll work through the early failures and — even if things ultimately change shape or don't work out — you'll never regret going for it.”"
    ],
    "scraped_at": "2025-12-30T11:47:32.529124"
  },
  {
    "url": "https://jamesclear.com/3-2-1/december-11-2025",
    "title": "3-2-1: Being great today, what to do when things don't go well, and favorite type of mental toughness",
    "ideas": [
      "“When things don't go well it's easy to wonder, “Why me?” It's easy to point fingers. It's easy to wallow in frustration or defeat. But it is also easy to ask, “What is this teaching me?” You can't remove the frustrations from life, but you can always try to come out a little wiser on the other side.”",
      "​II. “My favorite type of mental toughness is not forcing one path, but being open to many paths: Whatever comes my way, I can handle it. Whatever resources I have, I can make it work. Whatever the day brings, I can thrive.”",
      "“Earlier this week I​read a line​that stood out to me, “Your goal in life should be to reduce the amount of time it takes you to get out of a bad state.” The ability to bounce back quickly is a key skill in life. My wife once told me, “When you're five, you can be mad for a day. When you're ten, you can be mad for an hour. By the time you're thirty, you get ten minutes—and then you have to move on.” Life is full of moments of frustration and disappointment. Growth and maturity is learning to pull yourself out of a bad state faster.”"
    ],
    "scraped_at": "2025-12-30T11:47:32.891674"
  }
]